app/controllers/comments_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "review_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "etre`"], ["body", "ihwoir"], ["review_id", 10], ["created_at", "2017-07-27 23:19:16.455444"], ["updated_at", "2017-07-27 23:19:16.455444"]]
---
  def create
    @review = Review.find(params[:review_id])
    @comment = @review.comments.create(comment_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."review_id" = ? AND "comments"."id" = ? LIMIT ?  [["review_id", 10], ["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
  def destroy
    @review = Review.find(params[:review_id])
    @comment = @review.comments.find(params[:id])
    @comment.destroy