app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user = User.first
    if @review.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("name", "movie", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "name" = ?, "movie" = ?, "description" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["name", "new name"], ["movie", "new movie"], ["description", "new description"], ["updated_at", "2017-07-13 07:27:23.516311"], ["id", 1]]

  def destroy
    Review.find(params[:id]).destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 3]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def set_rev
      @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]