app/controllers/sessions_controller.rb

  def create
    # All emails are stored lowercase
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "simon@example.com"], ["LIMIT", 1]]