app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "AshKethchup"], ["email", "test@test.com"], ["updated_at", "2017-07-27 04:55:32.433301"], ["id", 1]]
---
  def update
    if @user.update(user_params)